# running in reg_file_prove/src/
read -sv reg_file.sv
read -sv reg_file_assertions.sv
prep -top reg_file_assertions

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
